Delans-TLE/src/Documents/ES_Инвентаризация/ES_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_Инвентаризация</name>
  <registerRecords>InformationRegister.ES_ИзменяемыеРеквизитыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ES_ЗаказыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаТекущая</name>
      <comment>Ячейка, в которой сейчас находится заказ</comment>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <comment>Ячейка, в которую необходимо переместить заказ</comment>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНедостачи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВхНакладная</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Излишек</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Мест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Грузы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиВЗаказе</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатурыЗапас</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НППлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбьявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Опасность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/InformationRegisters/ES_ИзменяемыеРеквизитыЗаказов/ES_ИзменяемыеРеквизитыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_ИзменяемыеРеквизитыЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ES_КомментарииКСтатусам</types>
      <types>Boolean</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Ячейки</types>
      <types>EnumRef.ES_ТипыПлательщиков</types>
      <types>EnumRef.ES_ТипыДенежныхСредствОплатаПолучателем</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РеквизитЗаказа</name>
    <type>
      <types>EnumRef.ES_ИзменяемыеРеквизитыЗаказа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/AccumulationRegisters/ES_ЗаказыНаСкладе/ES_ЗаказыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ES_ЗаказыНаСкладе</name>
  <comment>Принятые заказы на склад</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Delans-TLE/src/Enums/ES_ВидыСтартовыхНастроек/ES_ВидыСтартовыхНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ES_ВидыСтартовыхНастроек</name>
  <enumValues>
    <name>ВидЗабора</name>
  </enumValues>
  <enumValues>
    <name>ВидОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДеньДоставки</name>
  </enumValues>
  <enumValues>
    <name>ДопКассаНП</name>
  </enumValues>
  <enumValues>
    <name>КассаНаложенныхПлатежей</name>
  </enumValues>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойГород</name>
  </enumValues>
  <enumValues>
    <name>Плательщик</name>
  </enumValues>
  <enumValues>
    <name>РозничныйПокупатель</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисЛогин</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисПароль</name>
  </enumValues>
  <enumValues>
    <name>СмсСервисСервер</name>
  </enumValues>
  <enumValues>
    <name>УслугаДоставки</name>
  </enumValues>
  <enumValues>
    <name>УслугаРКО</name>
  </enumValues>
  <enumValues>
    <name>УслугаСамовывоза</name>
  </enumValues>
  <enumValues>
    <name>УслугаСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Характеристика</name>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьГрузы</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Удалить_ИспользоватьЗабор</name>
    <comment>НЕ ИСПОЛЬЗУЕТСЯ</comment>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяС</name>
  </enumValues>
  <enumValues>
    <name>Метка1ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка2ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка3ВремяПо</name>
  </enumValues>
  <enumValues>
    <name>Метка1Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка2Цвет</name>
  </enumValues>
  <enumValues>
    <name>Метка3Цвет</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВремяНаКарте</name>
  </enumValues>
  <enumValues>
    <name>СистемаОпределенияКоординат</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСтраховки</name>
  </enumValues>
  <enumValues>
    <name>Коэффициент</name>
    <comment>Коэффициент расчета объемного веса</comment>
  </enumValues>
  <enumValues>
    <name>ES_Переключатель</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPСервер</name>
  </enumValues>
  <enumValues>
    <name>ES_FTPПорт</name>
  </enumValues>
  <enumValues>
    <name>ES_Пользователь</name>
  </enumValues>
  <enumValues>
    <name>ES_Пароль</name>
  </enumValues>
  <enumValues>
    <name>ES_Каталог</name>
  </enumValues>
  <enumValues>
    <name>ПоискЗаказовПоВхНакладной</name>
    <comment>Истина - При поиске по штрихкоду заказы подбираются по Вх накладной,  Ложь - По НомеруНакладной</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПринятКурьером</name>
    <comment>При создании плана заказам автоматически присваивается статус &quot;Принят курьером&quot;</comment>
  </enumValues>
  <enumValues>
    <name>АвтоПриемЗаборов</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДляГрузов</name>
  </enumValues>
  <enumValues>
    <name>Метка1Код</name>
  </enumValues>
  <enumValues>
    <name>Метка2Код</name>
  </enumValues>
  <enumValues>
    <name>Метка3Код</name>
  </enumValues>
  <enumValues>
    <name>КодСкладДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвери</name>
  </enumValues>
  <enumValues>
    <name>КодДвериДвериУпрощенный</name>
  </enumValues>
  <enumValues>
    <name>КодСамовывоз</name>
  </enumValues>
  <enumValues>
    <name>КодДвериТерминал</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалТерминал</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураДляЧека</name>
  </enumValues>
  <enumValues>
    <name>ИспользоватьНоменклатуруДляЧеков</name>
  </enumValues>
  <enumValues>
    <name>ВидДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьДДуНаКарте</name>
  </enumValues>
  <enumValues>
    <name>УслугаСбора</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаОсновная</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЯчейкаПроблема</name>
  </enumValues>
  <enumValues>
    <name>КодТерминалПВЗ</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляСбора</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ТокенБотаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ИДЧатаДляТелеграм</name>
  </enumValues>
  <enumValues>
    <name>ШаблонСообщенияДляВидаЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЛогинПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>ПарольПользователяИБ</name>
  </enumValues>
  <enumValues>
    <name>АдресСклада</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаДолгота</name>
  </enumValues>
  <enumValues>
    <name>АдресСкладаШирота</name>
  </enumValues>
</mdclass:Enum>

Delans-TLE/src/Documents/ES_Инвентаризация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ES_ИзменяемыеРеквизитыЗаказов
	Если ПолучитьФункциональнуюОпцию("УчетПоЯчейкам") Тогда
		
		ЯчейкаПроблема = ES_ОбщегоНазначения.ПолучитьСтартовуюНастройку(Перечисления.ES_ВидыСтартовыхНастроек.ЯчейкаПроблема);
	
		Движения.ES_ИзменяемыеРеквизитыЗаказов.Записывать = Истина;
		Для Каждого ТекСтрокаЗаказы Из Заказы Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрокаЗаказы.ЯчейкаПолучатель) Тогда
				Продолжить;
			КонецЕсли;
			Если ТекСтрокаЗаказы.Проверен Тогда
				
				//ТекСтрокаЗаказы.ЯчейкаПолучатель <> Ячейка 
				Если ТекСтрокаЗаказы.ЯчейкаТекущая <> ТекСтрокаЗаказы.ЯчейкаПолучатель Тогда	
					Движение 				= Движения.ES_ИзменяемыеРеквизитыЗаказов.Добавить();
					Движение.Период 		= Дата;
					Движение.Заказ 			= ТекСтрокаЗаказы.Заказ;
					Движение.РеквизитЗаказа = Перечисления.ES_ИзменяемыеРеквизитыЗаказа.Ячейка;
					Движение.Значение 		= ТекСтрокаЗаказы.ЯчейкаПолучатель;
				КонецЕсли;
			Иначе
				Если НЕ ТекСтрокаЗаказы.ЯчейкаТекущая = ЯчейкаПроблема Тогда
					Движение 				= Движения.ES_ИзменяемыеРеквизитыЗаказов.Добавить();
					Движение.Период 		= Дата;
					Движение.Заказ 			= ТекСтрокаЗаказы.Заказ;
					Движение.РеквизитЗаказа = Перечисления.ES_ИзменяемыеРеквизитыЗаказа.Ячейка;
					Движение.Значение 		= ЯчейкаПроблема;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	 
	Движения.ES_ЗаказыНаСкладе.Записывать = Истина;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ES_ИнвентаризацияЗаказы.Заказ,
	|	ES_ИнвентаризацияЗаказы.Проверен
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ES_Инвентаризация.Заказы КАК ES_ИнвентаризацияЗаказы
	|ГДЕ
	|	ES_ИнвентаризацияЗаказы.Ссылка = &Ссылка
	|	И (ES_ИнвентаризацияЗаказы.ЯчейкаТекущая ЕСТЬ NULL
	|			ИЛИ ES_ИнвентаризацияЗаказы.ЯчейкаТекущая = &ПустаяЯчейка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ,
	|	ES_ЗаказыНаСкладеОстатки.Склад,
	|	ЕСТЬNULL(ES_ЗаказыНаСкладеОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВТ_Заказы.Проверен
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ES_ЗаказыНаСкладе.Остатки(
	|				&МоментВремени,
	|				Заказ В
	|					(ВЫБРАТЬ
	|						ВТ_Заказы.Заказ
	|					ИЗ
	|						ВТ_Заказы КАК ВТ_Заказы)) КАК ES_ЗаказыНаСкладеОстатки
	|		ПО ВТ_Заказы.Заказ = ES_ЗаказыНаСкладеОстатки.Заказ";
	
	Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 	Справочники.Ячейки.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Проверен <> Истина Тогда			
			Продолжить;
		КонецЕсли;
		
		Если Выборка.КоличествоОстаток > 0 Тогда
			Продолжить;
			//Отказ = Истина;
			//Сообщить( НСтр("ru = 'Заказ " + Выборка.Заказ +" уже оприходован на склад " + Выборка.Склад +"'"));
		Иначе
			Движение = Движения.ES_ЗаказыНаСкладе.ДобавитьПриход();
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Заказ = Выборка.Заказ;
			Движение.Количество	= 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
